In [2]:
import pandas as pd

In [9]:
df = pd.read_csv(r'C:\Users\Anujl\OneDrive\Documents\Level5\AI\worksheet2\Titanic-Dataset.csv')

In [11]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 891 entries, 0 to 890
Data columns (total 12 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   PassengerId  891 non-null    int64
 1   Survived     891 non-null    int64
 2   Pclass       891 non-null    int64
 3   Name         891 non-null    object
 4   Sex          891 non-null    object
 5   Age          714 non-null    float64
 6   SibSp        891 non-null    int64
 7   Parch        891 non-null    int64
 8   Ticket       891 non-null    object
 9   Fare         891 non-null    float64
 10  Cabin        204 non-null    object
 11  Embarked     889 non-null    object
dtypes: float64(2), int64(5), object(5)
memory usage: 83.7+ KB

In [27]:
#Problem 1 - Sorting
#1
fare = df[['Fare']]
fare.head()

      Fare
0   7.2500
1  71.2833
2   7.9250
3  53.1000
4   8.0500

In [26]:
#2
class_age = df[['Pclass', 'Age']]
class_age.head()

   Pclass   Age
0       3  22.0
1       1  38.0
2       3  26.0
3       1  35.0
4       3  35.0

In [28]:
#3
survived_gender = df[['Survived','Sex']]
survived_gender.head()

   Survived     Sex
0         0    male
1         1  female
2         1  female
3         1  female
4         0    male

In [30]:
#Probelm 2 - Subsetting
#1
fare_gt_100 = df[df['Fare']>100]
fare_gt_100.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S

In [31]:
#2
first_class = df[df['Pclass']==1]
first_class.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
6,7,0,1,"McCarthy, Mr. Timothy J",male,54.0,0,0,17463,51.8625,E46,S
11,12,1,1,"Bonnell, Miss. Elizabeth",female,58.0,0,0,113783,26.5500,C103,S
23,24,1,1,"Sloper, Mr. William Thompson",male,28.0,0,0,113788,35.5000,A6,S

In [36]:
female_under_18 = df[(df['Age']<18)&(df['Sex']=='female')]
female_under_18.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
9,10,1,2,"Nasser, Mrs. Nicholas (Adele Achem)",female,14.0,1,0,237736,30.0708,NaN,C
10,11,1,3,"Sandstrom, Miss. Marguerite Rut",female,4.0,1,1,PP 9549,16.7000,G6,S
14,15,0,3,"Vestrom, Miss. Hulda Amanda Adolfina",female,14.0,0,0,350406,7.8542,NaN,S
22,23,1,3,"McGowan, Miss. Anna ""Annie""",female,15.0,0,0,330923,8.0292,NaN,Q
24,25,0,3,"Palsson, Miss. Torborg Danira",female,8.0,3,1,349909,21.0750,NaN,S

In [42]:
embarked_c_or_s = df[(df['Embarked']=='C') | (df['Embarked']=='S')]
embarked_c_or_s.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S

In [43]:
first_second_class = df[(df['Pclass']==1) | (df['Pclass']==2)]
first_second_class.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
6,7,0,1,"McCarthy, Mr. Timothy J",male,54.0,0,0,17463,51.8625,E46,S
9,10,1,2,"Nasser, Mrs. Nicholas (Adele Achem)",female,14.0,1,0,237736,30.0708,NaN,C
11,12,1,1,"Bonnell, Miss. Elizabeth",female,58.0,0,0,113783,26.5500,C103,S

In [61]:
#Which passenger had the highest fare paid relative to their age?
df['fare_per_year'] = df['Fare'] / df['Age']
high_fare_age = df[df['fare_per_year'] > 5]
high_fare_age_srt = high_fare_age.sort_values(by='fare_per_year', ascending=False)
result = high_fare_age_srt[['Name', 'fare_per_year']]
result.head(30)

                                                  Name  fare_per_year
305                     Allison, Master. Hudson Trevor     164.728261
297                       Allison, Miss. Helen Loraine      75.775000
386                    Goodwin, Master. Sidney Leonard      46.900000
164                       Panula, Master. Eino Viljami      39.687500
183                          Becker, Master. Richard F      39.000000
827                              Mallet, Master. Andre      37.004200
78                       Caldwell, Master. Alden Gates      34.939759
644                             Baclini, Miss. Eugenie      25.677733
469                      Baclini, Miss. Helene Barbara      25.677733
831                    Richards, Master. George Sibley      22.590361
755                          Hamalainen, Master. Viljo      21.641791
788                         Dean, Master. Bertram Vere      20.575000
445                          Dodge, Master. Washington      20.464575
803                    Thomas, Master. Assad Alexander      20.277857
824                       Panula, Master. Urho Abraham      19.843750
381                        Nakid, Miss. Maria ("Mary")      15.741700
119                  Andersson, Miss. Ellis Anna Maria      15.637500
737                             Lesurer, Mr. Gustave J      14.637977
258                                   Ward, Miss. Anna      14.637977
311                         Ryerson, Miss. Emily Borie      14.576389
16                                Rice, Master. Eugene      14.562500
679                 Cardeza, Mr. Thomas Drake Martinez      14.231367
689                  Madill, Miss. Georgette Alexandra      14.089167
642                      Skoog, Miss. Margit Elizabeth      13.950000
43            Laroche, Miss. Simonne Marie Anne Andree      13.859733
27                      Fortune, Mr. Charles Alexander      13.842105
530                           Quick, Miss. Phyllis May      13.000000
340                     Navratil, Master. Edmond Roger      13.000000
700  Astor, Mrs. John Jacob (Madeleine Talmadge Force)      12.640278
742              Ryerson, Miss. Susan Parker "Suzette"      12.494048

In [67]:
# Which adult male passenger (age ≥ 18 and Sex is ’male’) paid the highest fare relative to their class?
df['fare_per_class'] = df['Fare'] / df['Pclass']
adult_males = df[(df['Sex']=='male') & (df['Age']>=18)]
adult_males_srt = adult_males.sort_values(by='fare_per_class', ascending=False)
result = adult_males_srt[['Name','Age','fare_per_class']]
result.head()

                                   Name   Age  fare_per_class
737              Lesurer, Mr. Gustave J  35.0        512.3292
679  Cardeza, Mr. Thomas Drake Martinez  36.0        512.3292
27       Fortune, Mr. Charles Alexander  19.0        263.0000
438                   Fortune, Mr. Mark  64.0        263.0000
118            Baxter, Mr. Quigg Edmond  24.0        247.5208

In [79]:
total_fare = df['Fare'].sum()
print("Total Fare =",total_fare)
fare_one = df[df['Pclass']==1]['Fare'].sum()
fare_two = df[df['Pclass']==2]['Fare'].sum()
fare_three = df[df['Pclass']==3]['Fare'].sum()
print("Total Fare 1st class =",fare_one)
print("Total Fare 2nd class =",fare_two)
print("Total Fare 3rd class =",fare_three)

Total Fare = 28693.9493
Total Fare 1st class = 18177.4125
Total Fare 2nd class = 3801.8417
Total Fare 3rd class = 6714.6951

In [88]:
fare_list = df.groupby('Pclass')['Fare'].sum().tolist()
print("Fare in list",fare_list)

Fare in list [18177.4125, 3801.8417, 6714.6951]

In [96]:
revenue = (fare_list)/(total_fare)
print(revenue)

[0.63349288 0.13249629 0.23401084]

In [97]:
#What percent of the total number of passengers on the Titanic belonged to each age group (e.g., child, adult, senior)?
df['age_group'] = pd.cut(df['Age'], bins=[0, 18, 65, 200], labels = ['child', 'adult', 'senior'], right=False)

total_passengers = df.shape[0]

child_passengers = df[df['age_group'] == 'child'].shape[0]
adult_passengers = df[df['age_group'] == 'adult'].shape[0]
senior_passengers = df[df['age_group'] == 'senior'].shape[0]

child_passengers_percentage = (child_passengers/total_passengers) * 100
adult_passengers_percentage = (adult_passengers/total_passengers) * 100
senior_passengers_percentage = (senior_passengers/total_passengers) * 100

print(child_passengers_percentage)
print(adult_passengers_percentage)
print(senior_passengers_percentage)

12.682379349046016
86.08305274971941
1.2345679012345678